In [19]:
import pandas as pd

In [20]:
car_sales = pd.read_csv('car_sales_2024.csv')

In [21]:
car_sales.shape

(5000, 15)

In [22]:
car_sales.head()

,sale_id,sale_date,customer_id,car_make,car_model,car_year,category,color,mileage,sale_price,payment_method,dealership,salesperson,state,commission
0,SALE20244500,2024-01-01,CUST14500,Honda,Accord,2023,Sedan,Black,16,29518.87,Lease,Westside Auto,David Anderson,FL,850.20
1,SALE20241760,2024-01-01,CUST11760,BMW,3 Series,2024,Luxury,Black,35,47624.88,Finance,North Point Cars,Mary Jackson,IL,1012.44
2,SALE20241772,2024-01-01,CUST11772,Mazda,CX-5,2024,SUV,White,8,31947.14,Finance,Downtown Motors,Emily Davis,PA,1079.20
3,SALE20241776,2024-01-01,CUST11776,Nissan,Rogue,2023,SUV,Brown,10,30553.60,Lease,Downtown Motors,Sarah Johnson,PA,1296.27
4,SALE20242044,2024-01-01,CUST12044,Ford,F-150,2024,Truck,White,23,46295.44,Cash,Downtown Motors,James Thomas,NC,1958.91

In [23]:
# Get the sales for a given state
state = input("Enter the state: ")
state_sales = car_sales.query("state == @state")

In [24]:
state_sales.shape

(0, 15)

In [25]:
state_sales.head()

Empty DataFrame
Columns: [sale_id, sale_date, customer_id, car_make, car_model, car_year, category, color, mileage, sale_price, payment_method, dealership, salesperson, state, commission]
Index: []

In [26]:
# Get sales by state
state_sales = car_sales.groupby('state'). \
    agg(total_sales=('sale_price', 'sum'), \
        sale_count=('sale_price', 'count'))

In [27]:
state_sales.shape

(10, 2)

In [28]:
state_sales.head()

       total_sales  sale_count
state
CA     18727709.11         509
FL     20220854.18         538
GA     18921434.95         505
IL     20205300.48         512
MI     18264746.87         498

In [29]:
state_sales. \
    reset_index(). \
    sort_values('total_sales', ascending=False)

  state  total_sales  sale_count
1    FL  20220854.18         538
3    IL  20205300.48         512
7    OH  19920681.73         524
6    NY  19062197.61         508
2    GA  18921434.95         505
0    CA  18727709.11         509
9    TX  18309337.33         489
4    MI  18264746.87         498
8    PA  17866692.35         480
5    NC  16101036.37         437